In [1]:
#File Path 등과 같은 부분을 사용하기 위해서는 기본적으로는 다음과 같은 패키지를 로딩해야
############Pandas&
import os
import sys
import pandas as pd

In [2]:
import sys
sys.version

'3.7.6 (default, Jan  8 2020, 20:23:39) [MSC v.1916 64 bit (AMD64)]'

In [9]:
testCSV_path="C:\\Users\\acorn-508\\python\\sampledata\\01_olive.csv"
olive_oil = pd.read_csv(testCSV_path)
olive_oil.head(10)

,Unnamed: 0,region,area,palmitic,palmitoleic,stearic,oleic,linoleic,linolenic,arachidic,eicosenoic
0,1.North-Apulia,1,1,1075,75,226,7823,672,36,60,29
1,2.North-Apulia,1,1,1088,73,224,7709,781,31,61,29
2,3.North-Apulia,1,1,911,54,246,8113,549,31,63,29
3,4.North-Apulia,1,1,966,57,240,7952,619,50,78,35
4,5.North-Apulia,1,1,1051,67,259,7771,672,50,80,46
5,6.North-Apulia,1,1,911,49,268,7924,678,51,70,44
6,7.North-Apulia,1,1,922,66,264,7990,618,49,56,29
7,8.North-Apulia,1,1,1100,61,235,7728,734,39,64,35
8,9.North-Apulia,1,1,1082,60,239,7745,709,46,83,33
9,10.North-Apulia,1,1,1037,55,213,7944,633,26,52,30

In [10]:
olive_oil = pd.read_csv(testCSV_path, header=None)
olive_oil.head(3)

,0,1,2,3,4,5,6,7,8,9,10
0,NaN,region,area,palmitic,palmitoleic,stearic,oleic,linoleic,linolenic,arachidic,eicosenoic
1,1.North-Apulia,1,1,1075,75,226,7823,672,36,60,29
2,2.North-Apulia,1,1,1088,73,224,7709,781,31,61,29

In [11]:
olive_oil = pd.read_csv(testCSV_path, names=["a","b","c","d"])
olive_oil.head(3)

,,,,,,,a,b,c,d
NaN,region,area,palmitic,palmitoleic,stearic,oleic,linoleic,linolenic,arachidic,eicosenoic
1.North-Apulia,1,1,1075,75,226,7823,672,36,60,29
2.North-Apulia,1,1,1088,73,224,7709,781,31,61,29

In [12]:
olive_oil = pd.read_csv(testCSV_path, skiprows=1)
olive_oil.head(3)

   1.North-Apulia  1  1.1  1075  75  226  7823  672  36  60  29
0  2.North-Apulia  1    1  1088  73  224  7709  781  31  61  29
1  3.North-Apulia  1    1   911  54  246  8113  549  31  63  29
2  4.North-Apulia  1    1   966  57  240  7952  619  50  78  35

In [14]:
olive_oil= pd.read_csv(testCSV_path)
olive_oil.head(3)

,Unnamed: 0,region,area,palmitic,palmitoleic,stearic,oleic,linoleic,linolenic,arachidic,eicosenoic
0,1.North-Apulia,1,1,1075,75,226,7823,672,36,60,29
1,2.North-Apulia,1,1,1088,73,224,7709,781,31,61,29
2,3.North-Apulia,1,1,911,54,246,8113,549,31,63,29

rename을 이용하여 처음 비어있는 컬럼의 이름 변경

In [ ]:
#id_area로 컬럼 이름 수정

In [22]:
olive_oil.columns[0]

'Unnamed: 0'

In [23]:
olive_oil.rename(columns={olive_oil.columns[0]:"id_area"}, inplace=True)
olive_oil.head(3)

,id_area,region,area,palmitic,palmitoleic,stearic,oleic,linoleic,linolenic,arachidic,eicosenoic
0,1.North-Apulia,1,1,1075,75,226,7823,672,36,60,29
1,2.North-Apulia,1,1,1088,73,224,7709,781,31,61,29
2,3.North-Apulia,1,1,911,54,246,8113,549,31,63,29

In [25]:
len(olive_oil["id_area"].unique())

572

In [26]:
len(olive_oil)

572

In [27]:
olive_oil.shape[0]

572

In [32]:
olive_oil["id_area"][0]

'1.North-Apulia'

In [36]:
olive_oil["id_area"][0].split(".")

['1', 'North-Apulia']

In [31]:
olive_oil["id_area"][0].split(".")[0]

'1'

In [33]:
int(olive_oil["id_area"][0].split(".")[0])

1

In [34]:
int(olive_oil["id_area"][0].split(".")[0])-1

0

In [35]:
str(int(olive_oil["id_area"][0].split(".")[0])-1)

'0'

In [43]:
str(int('1.North-Apulia'.split(".")[0])-1)+"_"+'1.North-Apulia'.split(".")[1]

'0_North-Apulia'

In [44]:
str(int(olive_oil["id_area"][0].split(".")[0])-1)+"_"+olive_oil["id_area"][0].split(".")[1]

'0_North-Apulia'

In [50]:
olive_oil["id_area"].apply(lambda x: str(int(x.split(".")[0])-1)+"_"+x.split(".")[1])

0        0_North-Apulia
1        1_North-Apulia
2        2_North-Apulia
3        3_North-Apulia
4        4_North-Apulia
             ...
567    567_West-Liguria
568    568_West-Liguria
569    569_West-Liguria
570    570_West-Liguria
571    571_West-Liguria
Name: id_area, Length: 572, dtype: object

In [56]:
olive_oil["id_area"] = olive_oil["id_area"].apply(lambda x: str(int(x.split(".")[0])-1)+"_"+x.split(".")[1])
olive_oil.head(5)

,id_area,region,area,palmitic,palmitoleic,stearic,oleic,linoleic,linolenic,arachidic,eicosenoic
0,0_North-Apulia,1,1,1075,75,226,7823,672,36,60,29
1,1_North-Apulia,1,1,1088,73,224,7709,781,31,61,29
2,2_North-Apulia,1,1,911,54,246,8113,549,31,63,29
3,3_North-Apulia,1,1,966,57,240,7952,619,50,78,35
4,4_North-Apulia,1,1,1051,67,259,7771,672,50,80,46

Q) palmitoleic칼럼 값을 100으로 나누어서 소수로 표시하시오. apply/lambda 사용하기.

In [58]:
olive_oil["palmitoleic"].apply(lambda x: x/100)

0      0.75
1      0.73
2      0.54
3      0.57
4      0.67
       ...
567    1.10
568    1.00
569    0.90
570    1.20
571    0.80
Name: palmitoleic, Length: 572, dtype: float64

In [59]:
olive_oil["palmitoleic"] = olive_oil["palmitoleic"].apply(lambda x: x/100)
olive_oil.head()

,id_area,region,area,palmitic,palmitoleic,stearic,oleic,linoleic,linolenic,arachidic,eicosenoic
0,0_North-Apulia,1,1,1075,0.75,226,7823,672,36,60,29
1,1_North-Apulia,1,1,1088,0.73,224,7709,781,31,61,29
2,2_North-Apulia,1,1,911,0.54,246,8113,549,31,63,29
3,3_North-Apulia,1,1,966,0.57,240,7952,619,50,78,35
4,4_North-Apulia,1,1,1051,0.67,259,7771,672,50,80,46

In [60]:
olive_oil.to_csv("olive2.csv")

In [61]:
comma_path="C:\\Users\\acorn-508\\python\\sampledata\\02_surveys.csv"
at_path="C:\\Users\\acorn-508\\python\\sampledata\\03_surveys_withAt.csv"

#구분자 디폴트값 => 콤마임!
data_comma = pd.read_csv(comma_path)
data_comma

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,1,7,16,1977,2,NL,M,32.0,NaN
1,2,7,16,1977,3,NL,M,33.0,NaN
2,3,7,16,1977,2,DM,F,37.0,NaN
3,4,7,16,1977,7,DM,M,36.0,NaN
4,5,7,16,1977,3,DM,M,35.0,NaN
...,...,...,...,...,...,...,...,...,...
35544,35545,12,31,2002,15,AH,NaN,NaN,NaN
35545,35546,12,31,2002,15,AH,NaN,NaN,NaN
35546,35547,12,31,2002,10,RM,F,15.0,14.0
35547,35548,12,31,2002,7,DO,M,36.0,51.0
35548,35549,12,31,2002,5,NaN,NaN,NaN,NaN

In [63]:
#구분자 설정 필요=> sep=""
data_at = pd.read_csv(at_path, sep="@")
data_at

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,1,7,16,1977,2,NL,M,32.0,NaN
1,2,7,16,1977,3,NL,M,33.0,NaN
2,3,7,16,1977,2,DM,F,37.0,NaN
3,4,7,16,1977,7,DM,M,36.0,NaN
4,5,7,16,1977,3,DM,M,35.0,NaN
...,...,...,...,...,...,...,...,...,...
35544,35545,12,31,2002,15,AH,NaN,NaN,NaN
35545,35546,12,31,2002,15,AH,NaN,NaN,NaN
35546,35547,12,31,2002,10,RM,F,15.0,14.0
35547,35548,12,31,2002,7,DO,M,36.0,51.0
35548,35549,12,31,2002,5,NaN,NaN,NaN,NaN

In [64]:
import sys
import os
import glob

In [65]:
#06_manyfile에 있는 확장자csv인 모든 파일을 가져오고자 할때=> *.csv
many_file_path="C:\\Users\\acorn-508\\python\\sampledata\\06_manyfile\\*.csv"
many_file_path

'C:\\Users\\acorn-508\\python\\sampledata\\06_manyfile\\*.csv'

In [66]:
glob.glob(many_file_path)

['C:\\Users\\acorn-508\\python\\sampledata\\06_manyfile\\1763.csv',
 'C:\\Users\\acorn-508\\python\\sampledata\\06_manyfile\\1764.csv',
 'C:\\Users\\acorn-508\\python\\sampledata\\06_manyfile\\1765.csv',
 'C:\\Users\\acorn-508\\python\\sampledata\\06_manyfile\\1766.csv',
 'C:\\Users\\acorn-508\\python\\sampledata\\06_manyfile\\1767.csv',
 'C:\\Users\\acorn-508\\python\\sampledata\\06_manyfile\\1768.csv',
 'C:\\Users\\acorn-508\\python\\sampledata\\06_manyfile\\1769.csv',
 'C:\\Users\\acorn-508\\python\\sampledata\\06_manyfile\\1770.csv',
 'C:\\Users\\acorn-508\\python\\sampledata\\06_manyfile\\1771.csv',
 'C:\\Users\\acorn-508\\python\\sampledata\\06_manyfile\\1772.csv']

In [67]:
glob.glob(many_file_path)[0]

'C:\\Users\\acorn-508\\python\\sampledata\\06_manyfile\\1763.csv'

In [92]:
os.path.basename(glob.glob(many_file_path)[0])

'1763.csv'

In [69]:
os.path.basename(glob.glob(many_file_path)[0]).split(".")[0]

'1763'

In [78]:
many_file_path="C:\\Users\\acorn-508\\python\\sampledata\\06_manyfile\\*.csv"
file_path_list=glob.glob(many_file_path)

for i in range(0,len(file_path_list)):
    temp=os.path.basename(file_path_list[i])
    temp=os.path.splitext(temp)[0]
    
    #data_1763=pd.read_csv(~~~.1763.csv)
    #문자열을 변수명으로 만들기=>vars()
    vars()["data_"+str(temp)]= pd.read_csv(file_path_list[i])

In [79]:
data_1763.head()

   ITE00100554  17630101  TMAX  -36  Unnamed: 4 Unnamed: 5  E  Unnamed: 7
0  ITE00100554  17630101  TMIN  -50         NaN        NaN  E         NaN
1  ITE00100554  17630102  TMAX  -26         NaN        NaN  E         NaN
2  ITE00100554  17630102  TMIN  -40         NaN        NaN  E         NaN
3  ITE00100554  17630103  TMAX   -9         NaN        NaN  E         NaN
4  ITE00100554  17630103  TMIN  -29         NaN        NaN  E         NaN

In [80]:
data_1772.head()

   ITE00100554  17720101  TMAX  51  Unnamed: 4 Unnamed: 5  E  Unnamed: 7
0  ITE00100554  17720101  TMIN  31         NaN        NaN  E         NaN
1  ITE00100554  17720102  TMAX  48         NaN        NaN  E         NaN
2  ITE00100554  17720102  TMIN  18         NaN        NaN  E         NaN
3  ITE00100554  17720103  TMAX  38         NaN        NaN  E         NaN
4  ITE00100554  17720103  TMIN  18         NaN        NaN  E         NaN

In [81]:
many_file_path="C:\\Users\\acorn-508\\python\\sampledata\\06_manyfile\\*.csv"
file_path_list=glob.glob(many_file_path)

data_tot = pd.DataFrame()

for i in range(0,len(file_path_list)):
    data_tot = data_tot.append(pd.read_csv(file_path_list[i], header=None),ignore_index=True)#ignore_index=> 기존인덱스 무시 후 다시 처음부터 인덱스를 다시 해달라

In [82]:
data_tot.shape

(7306, 8)

In [83]:
data_1772.shape

(731, 8)

In [93]:
data_tot.head()

             0         1     2   3   4    5  6   7
0  ITE00100554  17630101  TMAX -36 NaN  NaN  E NaN
1  ITE00100554  17630101  TMIN -50 NaN  NaN  E NaN
2  ITE00100554  17630102  TMAX -26 NaN  NaN  E NaN
3  ITE00100554  17630102  TMIN -40 NaN  NaN  E NaN
4  ITE00100554  17630103  TMAX  -9 NaN  NaN  E NaN

In [89]:
data_tot.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7306 entries, 0 to 7305
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       7306 non-null   object
 1   1       7306 non-null   int64
 2   2       7306 non-null   object
 3   3       7306 non-null   int64
 4   4       0 non-null      float64
 5   5       94 non-null     object
 6   6       7306 non-null   object
 7   7       0 non-null      float64
dtypes: float64(2), int64(2), object(4)
memory usage: 456.8+ KB

In [84]:
#엑셀은 sheet 이름 선정해줘야함
excel_path="C:\\Users\\acorn-508\\python\\sampledata\\07_surveys_excelformat.xls"
excel_data=pd.read_excel(excel_path, sheet_name="Sheet1")
excel_data.head(3)

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,1,7,16,1977,2,NL,M,32.0,NaN
1,2,7,16,1977,3,NL,M,33.0,NaN
2,3,7,16,1977,2,DM,F,37.0,NaN

In [86]:
excel_data=excel_data.fillna(0)
excel_data.head(3)

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,1,7,16,1977,2,NL,M,32.0,0.0
1,2,7,16,1977,3,NL,M,33.0,0.0
2,3,7,16,1977,2,DM,F,37.0,0.0

In [88]:
excel_out_path1="test_excel_old.xls"
excel_out_path2="test_excel_new.xlsx"

excel_data.to_excel(excel_out_path1)
excel_data.to_excel(excel_out_path2)

read_csv / read_excel/  => 쪼개서 가져오기

In [90]:
#185MB, 데이터는 약 21만개 데이터..
big_file_path="C:\\Users\\acorn-508\\python\\sampledata\\star0000-1.csv"

chunker = pd.read_csv(big_file_path, chunksize=1000)
tot = pd.concat([x for x in chunker], ignore_index=True)
tot.shape

(2173761, 12)

In [91]:
#데이터가 많지 않으면 그냥 불러올때와 별 차이 없음. 이정도면 스몰데이터 정도
pd.read_csv(big_file_path).head()

,266,909,159625,159627,2635,20000827.0117590018,1239029,1341,-26.399744,1228,0.56000537,48
0,317,1243,159625,159627,2636,2.000083e+07,1239029,1470,-29.075420,1415,0.464418,53
1,281,1285,159625,159627,2637,2.000083e+07,1239029,1663,-6.753542,1533,0.535974,8
2,204,1198,159625,159627,2638,2.000083e+07,1239029,1806,11.985353,1123,0.668971,32
3,288,988,159625,159627,2639,2.000083e+07,1239029,1409,-12.928666,1314,0.584983,39
4,251,1232,159625,159627,2640,2.000083e+07,1239029,930,26.815605,1153,0.532364,54